interface Parcel {
    name: string;
    address: string;
    schedule: {
        "Пн-Чт": string;
        "Пт-Сб": string;
    };
}

interface CityParcelNovaPost {
    city: string;
    ParcelNovaPost: Parcel[];
}

const ParcelNovaPost: CityParcelNovaPost[] = [
    {
        city: "Вінниця",
        ParcelNovaPost: [
            {
                name: "Поштомат №13",
                address: "вул. Київська, 134",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №23",
                address: "вул. Василя Порика, 46, прим. 49",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №26",
                address: "вул. Пирогова, 71а",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Луцьк",
        ParcelNovaPost: [
            {
                name: "Поштомат №10",
                address: "просп. Волі, 12",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №14",
                address: "просп. Відродження, 10",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №13",
                address: "просп. Волі, 35",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Дніпро",
        ParcelNovaPost: [
            {
                name: "Поштомат №50",
                address: "вул. Метробудівська, 19",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №2",
                address: "просп. Богдана Хмельницького, 31Д",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №163",
                address: "вул. Вокзальна, 6",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Донецьк",
        ParcelNovaPost: [
            {
                name: "Поштомат №11",
                address: "вул. Центральна, 64а",
                schedule: { "Пн-Чт": "08:00–19:00", "Пт-Сб": "09:00–18:00" }
            },
            {
                name: "Поштомат №27",
                address: "вул. Весняна, 40",
                schedule: { "Пн-Чт": "08:00–19:00", "Пт-Сб": "09:00–18:00" }
            },
            {
                name: "Поштомат №32",
                address: "вул. Будівельників, 8",
                schedule: { "Пн-Чт": "08:00–19:00", "Пт-Сб": "09:00–18:00" }
            }
        ]
    },
    {
        city: "Житомир",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "вул. Гранітна, 16",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №6",
                address: "вул. Київська, 104",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №17",
                address: "вул. Київська, 77 (ТРЦ «Глобал UA»)",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Ужгород",
        ParcelNovaPost: [
            {
                name: "Поштомат №10",
                address: "вул. Заньковецької, 48а",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №1",
                address: "вул. Волонтерів, 16",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №4",
                address: "вул. Капушанська, 168",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Запоріжжя",
        ParcelNovaPost: [
            {
                name: "Поштомат №8",
                address: "просп. Соборний, 43",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №13",
                address: "вул. Дніпровське шосе, 30",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №73",
                address: "вул. Харчова, 8",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Івано-Франківськ",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "вул. Максимовича, 8",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №2",
                address: "вул. Вовчинецька, 26",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №3",
                address: "вул. Залізнична, 4",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Київ",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "вул. Пирогівський шлях, 135",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №2",
                address: "вул. Богатирська, 11",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №3",
                address: "вул. Слобожанська, 13",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Кропивницький",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "вул. Олега Паршутіна, 28",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №2",
                address: "вул. Євгена Маланюка, 21",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №18",
                address: "вул. Набережна, 9",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },


    {
        city: "Львів",
        ParcelNovaPost: [
            {
                name: "Поштомат №11",
                address: "вул. Городоцька, 120",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №25",
                address: "вул. Ряшівська, 13",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №70",
                address: "вул. Шевченка, 108",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Миколаїв",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "просп. Героїв України, буд. 13",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №20",
                address: "просп. Богоявленський, 26/2",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №28",
                address: "вул. Озерна (ран. Червоних Майовщиків), 1-В",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Одеса",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "Київське шосе, 27",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №3",
                address: "вул. Дальницька, 23/4",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №71",
                address: "вул. Варненська, 15",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Полтава",
        ParcelNovaPost: [
            {
                name: "Поштомат №23",
                address: "вул. Котляревського, 10",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №3",
                address: "вул. Лідова, 13",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №15",
                address: "вул. Європейська, 94",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Рівне",
        ParcelNovaPost: [
            {
                name: "Поштомат №17",
                address: "вул. Центральна, 6а",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №34",
                address: "вул. Міцкевича, 2",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №10",
                address: "вул. Шкільна, 13",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Суми",
        ParcelNovaPost: [
            {
                name: "Поштомат №18",
                address: "вул. Іллінська, 56",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №4",
                address: "вул. Гетьмана Павла Скоропадського, 10/1",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №5",
                address: "вул. Юрія Вєтрова, 20",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Тернопіль",
        ParcelNovaPost: [
            {
                name: "Поштомат №10",
                address: "вул. Максима Кривоноса, 3",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №4",
                address: "вул. Заміська, 16",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №2",
                address: "вул. Руська, 5",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },

    {
        city: "Харків",
        ParcelNovaPost: [
            {
                name: "Поштомат №41",
                address: "просп. Героїв Харкова, 199б (ТЦ «СанСіті»)",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №36",
                address: "вул. Москалівська, 91",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №48",
                address: "просп. Слави, 5",
                schedule: { "Пн-Чт": "08:00–21:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Херсон",
        ParcelNovaPost: [
            {
                name: "Поштомат №12",
                address: "вул. Чорноморська, 16",
                schedule: { "Пн-Чт": "08:00–19:00", "Пт-Сб": "09:00–18:00" }
            },
            {
                name: "Поштомат №24",
                address: "просп. 200 років Херсону, 20",
                schedule: { "Пн-Чт": "08:00–19:00", "Пт-Сб": "09:00–18:00" }
            },
            {
                name: "Поштомат №11",
                address: "вул. Університетська, 110",
                schedule: { "Пн-Чт": "08:00–19:00", "Пт-Сб": "09:00–18:00" }
            }
        ]
    },
    {
        city: "Хмельницький",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "вул. Трудова, 5/4",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №9",
                address: "вул. Івана Пулюя, 7",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №24",
                address: "вул. Тернопільська, 10/6Б",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Черкаси",
        ParcelNovaPost: [
            {
                name: "Поштомат №6",
                address: "вул. Нижня Горова (Калініна), 44",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №4",
                address: "вул. Володимира Великого, 77",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №8",
                address: "вул. Надпільна (Ільїна), 326/66",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Чернівці",
        ParcelNovaPost: [
            {
                name: "Поштомат №17",
                address: "вул. Героїв Майдану, 63",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №4",
                address: "вул. Головна, 200",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №26",
                address: "вул. Вокзальна, 70",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Чернігів",
        ParcelNovaPost: [
            {
                name: "Поштомат №1",
                address: "вул. Старобілоуська, 77",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №15",
                address: "просп. Перемоги, 90",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №26",
                address: "вул. Вокзальна, 70",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Луганськ",
        ParcelNovaPost: [
            {
                name: "Поштомат №16",
                address: "вул. Центральна, 25",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №20",
                address: "просп. Свободи, 102",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №34",
                address: "вул. Оборонна, 14А",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    },
    {
        city: "Сімферополь",
        ParcelNovaPost: [
            {
                name: "Поштомат №9",
                address: "вул. Київська, 120",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №38",
                address: "просп. Перемоги, 45",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            },
            {
                name: "Поштомат №48",
                address: "вул. Гагаріна, 75",
                schedule: { "Пн-Чт": "08:00–20:00", "Пт-Сб": "09:00–19:00" }
            }
        ]
    }

];

export default ParcelNovaPost;
